In [1]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [2]:
df.columns = ['name', 'gender', 'age']

In [3]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [4]:
df.ix[1:2,['name', 'age']]#指定行和列

   name  age
1  mary   23
2   tom   35

In [5]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [6]:
#取出索引为1的行
df.ix[1]

name      mary
gender       F
age         23
Name: 1, dtype: object

In [9]:
#取出索引为1：4的行，注意4可以取到
df.ix[1:4]

   name gender  age
1  mary      F   23
2   tom      M   35
3   ted      M   33
4  jean      F   21

In [10]:
#取出名为name的这一列
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [11]:
#取出指定的两列
df[['name','age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [4]:
?df.ix

In [14]:
df['gender']

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [15]:
df.gender

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [16]:
#效果一样

In [17]:
#判断性别为男：male
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [18]:
#取出性别为男的行
df[df['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [20]:
#判断年龄是否大于30
df['age'] > 30

0    False
1    False
2     True
3     True
4    False
5    False
Name: age, dtype: bool

In [21]:
#取出年龄大于30的行
df[df['age'] > 30]

  name gender  age
2  tom      M   35
3  ted      M   33

In [23]:
#取出性别为男且年龄大于30的行
df[(df['gender'] == 'M') & (df['age'] > 30)]

  name gender  age
2  tom      M   35
3  ted      M   33

In [5]:
#取出性别为男或年龄大于30的行
df[(df['gender'] == 'M') | (df['age'] > 30)]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [6]:
#新加一列数据
df['employee'] = True

In [7]:
df.head()

    name gender  age employee
0  frank      M   29     True
1   mary      F   23     True
2    tom      M   35     True
3    ted      M   33     True
4   jean      F   21     True

In [8]:
#删除指定列
del df['employee']

In [9]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [10]:
df['employee'] = True
df.head()

    name gender  age employee
0  frank      M   29     True
1   mary      F   23     True
2    tom      M   35     True
3    ted      M   33     True
4   jean      F   21     True

In [11]:
#删除指定一列
df = df.drop('employee', axis = 1)

In [12]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [13]:
?df.drop

In [14]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [15]:
#索引为5的数据
df.loc[5]

name      lisa
gender       F
age         20
Name: 5, dtype: object

In [16]:
?df.loc

In [17]:
#用字典形式增加一列数据
df.loc[6] = {'age':20, 'gender': 'F', 'name':'qoo'}

In [18]:
#删除一列
df = df.drop(6)
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [19]:
#使用range增加一列数据
df['userid'] = range(101,107)

In [20]:
df

    name gender  age  userid
0  frank      M   29     101
1   mary      F   23     102
2    tom      M   35     103
3    ted      M   33     104
4   jean      F   21     105
5   lisa      F   20     106

In [21]:
df.set_index('userid', inplace=True)

In [22]:
df

         name gender  age
userid
101     frank      M   29
102      mary      F   23
103       tom      M   35
104       ted      M   33
105      jean      F   21
106      lisa      F   20

In [ ]:
a = 2